insert into EducationalProgram(EducationalProgramName)
values ('Комп*ютерна інженерія')

insert into Faculty(FacultyName)
values ('ФРЕКС')

insert into GraduateLevel(LevelName)
values('Бакалавр'),
('Магістр'),
('PhD')

insert into Mark(MarkDescription)
values ('Повністю не погоджуюсь'),
('Частково не погоджуюсь'),
('Не можу дати відповідь'),
('Частково погоджуюсь'),
('Повністю погоджуюсь')

insert into Question(QuestionDescription, FormMode)
values('Вміє зацікавити студентів своєю дисципліною;',1),
('Стимулює активність, творчість та самостійну роботу студентів;',1),
('Вільно володіє матеріалом з дисципліни;',1),
('Проводить заняття професійною, виразною та чіткою мовою;',1),
('Вміє доступно викласти матеріал дисципліни;',1),
('Висуває чіткі та несуперечливі вимоги до студентів;',1),
('Об’єктивно оцінює рівень знань студентів;',1),
('Поважає студентів, є тактовним;',1),
('Зацікавлений в успіхах студента',1),
('Вміє урізноманітнити зміст лекції фактами, прикладами, порівняннями, що активізують його сприйняття',1),
('Вміє зацікавити студентів своєю дисципліною',2),
('Стимулює активність, творчість та самостійну роботу студентів',2),
('Вільно володіє матеріалом з дисципліни;',2),
('Проводить заняття професійною, виразною та чіткою мовою',2),
('Вміє доступно викласти матеріал дисципліни',2),
('Висуває чіткі та несуперечливі вимоги до студентів',2),
('Об’єктивно оцінює рівень знань студентів',2),
('Поважає студентів, є тактовним',2),
('Зацікавлений в успіхах студента',2),
('Забезпечує високу ступінь реалізації мети заняття',2),
('Використовує під час занять наочні матеріали (презентації тощо)',2),
('Логічно вписується у структуру Освітньої програми',3),
('Дає можливість набути практичних навичок та вмінь',3),
('Потрібна для майбутньої професійної діяльності',3),
('Розширює світогляд',3),
('Дає нові знання',3),
('Насичена сучасним та актуальним науковим /науково-практичним матеріалом',3),
('Добре забезпечена навчально-науковою літературою та методичними матеріалами',3),
('Добре забезпечена необхідними методичними ресурсами/посібниками для організації самостійної роботи здобувачів освіти',3),
('Має прийнятний рівень складності',3),
('Лекції тісно пов*язані з іншими формами занять (семінарськими, практичними, лабораторними тощо)',3),
('Кількість годин аудиторних навчальних занять і самостійної роботи збалансована',3);

--QuestionMark not sure that we need to insert values here, probably I'll write that while saving form

insert into Subject(SubjectName,FacultyId,Semester)
values ('Системи автоматизації підприємств',1,8),
('Периферійні пристрої',1,8),
('Цифрова обробка сигналів',1,7),
('Функціональне програмування',1,7);

insert into SubjectTeacher(SubjectId,TeacherId)
values(1,1),
(1,2),
(2,3);

insert into Teacher(TeacherName)
values ('Загороднюк С.П.'),
('Слюсар Є.А.'),
('Самощенко О.В.'),
('Баужа О.С.');


insert into FacultyTeacher(FacultyId, TeacherId)
values(1,1),
(1,2),
(1,3),
(1,4)